app/views/tickets/_form.html.erb

    <%= f.label :gig_id %><br>
    <%= f.collection_select :gig_id, Gig.all, :id, :gig_name %>
---
SELECT "gigs".* FROM "gigs"

    <%= f.label :user_id %><br>
    <%= f.collection_select :user_id, User.all, :id, :name %>
---
SELECT "users".* FROM "users"