app/views/venues/show.html.erb

<% end %>
<%if @venue.comments.empty? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."venue_id" = ? LIMIT 1  [["venue_id", 2]]
SELECT "comments".* FROM "comments" WHERE "comments"."venue_id" = ?  [["venue_id", 1]]