app/controllers/comments_controller.rb

	def create
		@venue = Venue.find params[:venue_id]
		@comment = @venue.comments.new(comment_params)
		@comment.user_id = @current_user.id
		@comment.save
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "stars", "venue_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "Great venue. Nice staff"], ["stars", 4], ["venue_id", 1], ["user_id", 1], ["created_at", "2016-11-07 00:11:08.914406"], ["updated_at", "2016-11-07 00:11:08.914406"]]