app/controllers/gigs_controller.rb

SELECT "gigs".* FROM "gigs"
---
  def index
    @gigs = Gig.all

INSERT INTO "gigs" ("artist", "venue_id", "start_time", "tickets_remaining", "gig_name", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @gig = Gig.new(gig_params)

    respond_to do |format|
      if @gig.save

UPDATE "gigs" SET "attachment" = ?, "updated_at" = ? WHERE "gigs"."id" = ?  [["attachment", "communication2.docx"], ["updated_at", "2016-11-30 13:28:02.250294"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @gig.update(gig_params)

SELECT "gigs".* FROM "gigs" WHERE (gig_name LIKE '%District 8%')
SELECT COUNT(*) FROM "gigs" WHERE (venue LIKE '%Patrick Topping%')
---
  def search
	@gigs =Gig.search params[:query]
	unless @gigs.empty? #if !@modelnames.empty?

SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_gig
      @gig = Gig.find(params[:id])