app/controllers/lineitems_controller.rb

  def index
    @lineitems = Lineitem.all
---
SELECT "lineitems".* FROM "lineitems"

  def create
   ticket = Ticket.find(params[:ticket_id])
   @lineitem = @cart.add_ticket(ticket.id)
	respond_to do |format|
		if @lineitem.save
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-12-14 22:12:00.571701"], ["updated_at", "2016-12-14 22:12:00.571701"]]
INSERT INTO "lineitems" ("ticket_id", "cart_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ticket_id", 2], ["cart_id", 2], ["quantity", 1], ["created_at", "2016-12-14 22:12:00.610669"], ["updated_at", "2016-12-14 22:12:00.610669"]]
UPDATE "lineitems" SET "quantity" = ?, "updated_at" = ? WHERE "lineitems"."id" = ?  [["quantity", 2], ["updated_at", "2016-12-14 23:56:23.443070"], ["id", 1]]