app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-12-14 19:44:21.752844"], ["updated_at", "2016-12-14 19:44:21.752844"]]
INSERT INTO "orders" ("paymethod", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["paymethod", "Debit Card"], ["user_id", 2], ["created_at", "2016-12-15 00:00:15.233147"], ["updated_at", "2016-12-15 00:00:15.233147"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]
---
  def create
    @order = Order.new(order_params)
	@order.add_lineitems_from_cart(current_cart)
	@order.user_id = @current_user.id

    respond_to do |format|
      if @order.save
		Cart.destroy(session[:cart_id])