app/controllers/shop_controller.rb

  def index
	@tickets = Ticket.order("gig_id asc").all
---
SELECT "tickets".* FROM "tickets"  ORDER BY gig_id asc