app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("gig_id", "user_id", "price", "over_18s", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["gig_id", 1], ["user_id", 1], ["price", "€20"], ["over_18s", "t"], ["created_at", "2016-11-06 23:55:57.639631"], ["updated_at", "2016-11-06 23:55:57.639631"]]
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save

UPDATE "tickets" SET "price" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["price", "€20"], ["updated_at", "2016-12-14 20:08:40.690443"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @ticket.update(ticket_params)