app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "gender", "password_digest", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["email", "d@d.com"], ["gender", ""], ["password_digest", "d"], ["dob", "2016-11-06"], ["created_at", "2016-11-06 18:20:40.281829"], ["updated_at", "2016-11-06 18:20:40.281829"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "John Murphy"], ["email", "Jm@hotmail.com"], ["password_digest", "$2a$10$DSoLeKAXGH32y.6DKfCKKO8Iix3AlvmhMC8wXchxuIPCOPOE6HKa."], ["updated_at", "2016-12-14 23:15:48.517438"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)