app/controllers/venues_controller.rb

INSERT INTO "venues" ("name", "location", "capacity", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "District 8"], ["location", "Dublin"], ["capacity", "2000"], ["image", ""], ["created_at", "2016-11-03 14:24:09.719232"], ["updated_at", "2016-11-03 14:24:09.719232"]]
---
  def create
    @venue = Venue.new(venue_params)

    respond_to do |format|
      if @venue.save

UPDATE "venues" SET "location" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "venues"."id" = ?  [["location", "Swords"], ["latitude", 53.4557467], ["longitude", -6.219740600000001], ["updated_at", "2016-11-23 15:26:17.178383"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @venue.update(venue_params)

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_venue
      @venue = Venue.find(params[:id])