app/views/gigs/_form.html.erb

SELECT "venues".* FROM "venues"
---
    <%= f.label :venue_id %><br>
    <%= f.collection_select :venue_id, Venue.all, :id, :name %>